app/views/teams/show.haml

SELECT "people".* FROM "people" WHERE "people"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "people" WHERE "people"."team_id" = 1
---
        %strong Hey, listen!
        You should add a team image to your Team Profile. You can do that #{link_to "here", my_team_edit_url}.
    - if @team.people.count < 3
      .alert.alert-warning.alert-dismissable

SELECT "cars".* FROM "cars" WHERE "cars"."team_id" = 1
SELECT COUNT(*) FROM "cars" WHERE "cars"."team_id" = 1
---
        %strong Dude! Bro! Bro! Dude!
        You need a minimum of THREE (3) people on your team. Add some mates over #{link_to "here", new_person_url}.
    - if @team.cars.count < 1
      .alert.alert-warning.alert-dismissable

SELECT "teams".* FROM "teams" WHERE "teams"."id" = 1 LIMIT 1
---
      %h2 Team Members
      - @team.people.each do |p|
        .col-xs-12.col-sm-4.col-md-3.col-lg-3
          .thumbnail.team-member-thumbnail