old/app/controllers/register_controller.rb

  def create

    @team = if session[:team_id]
              Team.find(session[:team_id])
            else
              Team.new(params[:team])
            end
    @captain = Person.new(params[:person])

    if session[:team_id] or @team.save
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "teams" ("bio", "created_at", "image", "is_visible", "location", "name", "organization_name", "photo_url", "slug", "updated_at", "url", "video_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"